

def vectorizer (filename):

    with open(filename ,encoding="utf8") as file:
        in_file = file.read()
    dictionary = {
     'а':'a','б':'b','в':'v','г':'h',
      'ґ':'g', 'д':'d', 'е':'e' ,'є':'ie', 
      'ж':'zh', 'з':'z', 'и':'y', 'і':'i' ,
      'ї':'i', 'й':'i', 'к':'k', 'л':'l', 
      'м':'m', 'н':'n', 'о':'o', 'п':'p',
      'р':'r', 'с':'s', 'т':'t', 'у':'u' ,
      'ф':'f', 'х':'kh', 'ц':'ts' , 'ч':'ch', 'ш':'sh', 
      'щ':'shch', 'ю':'iu', 'я':'ia',
      'А':'A' , 'Б':'B' , 'В':'V' , 'Г':'H' ,
      'Ґ':'G' ,'Д':'D' ,'Е':'E' ,'Є':'Ye' , 'Ж':'Zh' , 
      'З':'Z' , 'И':'Y' , 'І':'I' , 'Ї':'Yi' , 'Й':'Y' ,
      'К':'K' , 'Л':'L' , 'М':'M' , 'Н':'N' , 'О':'O' , 'П':'P' ,'Р':'R' , 'С':'S' ,
      'Т':'T' , 'У':'U' ,'Ф':'F' , 'Х':'Kh', 'Ц':'Ts', 'Ч':'Ch' ,
      'Ш':'Sh' , 'Щ':'Shch' ,'Ю':'Yu' ,'Я':'Ya' , 'ь':'', "'":''
    }
    dictionary1 = {
        'A':'1', 'B':'2', 'C':'3', 'D':'4' , 
        'E':'5' , 'F':'6','G':'7', 'H':'8',
        'I':'9','J':'10','K':'11','L':'12',
        'M':'13','N':'14','O':'15','P':'16','Q':'17',
        'R':'18','S':'19','T':'20','U':'21',
        'V':'22','W':'23','X':'24',
        'Y':'25','Z':'26','a':'1', 'b':'2', 'c':'3', 'd':'4' , 
        'e':'5' , 'f':'6','g':'7', 'h':'8',
        'i':'9','j':'10','k':'11','l':'12',
        'm':'13','n':'14','o':'15','p':'16','q':'17',
        'r':'18','s':'19','t':'20','u':'21',
        'v':'22','w':'23','x':'24',
        'y':'25','z':'26', ' ':' ', '\n':'0', '.':'\n'}
    
    print (in_file)
    
    for i in dictionary :
            in_file = in_file.replace(i,dictionary[i])
    print (in_file)

    for i in dictionary1 :
        in_file = in_file.replace(i,dictionary1[i])
    print (in_file)
    
    

   
vectorizer ("text.txt")
